<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Transitional//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-transitional.dtd">
<html xml:lang="de" lang="de"
      xmlns="http://www.w3.org/1999/xhtml"
      xmlns:ui="http://java.sun.com/jsf/facelets"
      xmlns:h="http://java.sun.com/jsf/html">
<ui:composition template="/resources/layout.xhtml">
    <ui:define name="content">
        <div id="werke_left">
            <div class="werke_title">
                Ventplan
            </div>
            <div class="werke_content_wrapper">
                <div class="werke_content">
                    <p class="white">&lt;VENTPLAN&gt;</p>
                    <p>
                        <strong>Ventplan ist eine intuitiv bedienbare Software zur Unterst&uuml;tzung bei der Auslegung von L&uuml;ftungsanlagen.
                            Sie dient zur Berechnung von l&uuml;ftungstechnischen Ma&szlig;nahmen unter Orientierung an der DIN 1946-6.</strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Ventplan f&uuml;hrt auf Basis der erfassten Daten umfangreiche Berechnungen durch und erstellt in Verbindung
                        mit den hinterlegten Artikelst&auml;mmen verschiedener Hersteller und Gro&szlig;h&auml;ndler auf Wunsch detailreiche Angebote im PDF und/oder Open Document Format.
                    </p>
                    <p class="white text-r">
                        &lt;/VENTPLAN&gt;
                    </p>
                    <p class="white">&lt;WAS VENTPLAN LEISTET&gt;</p>
                    <p>
                        <strong>Ventplan erleichtert die Auslegung und Kalkulation von L&uuml;ftungsanlagen erheblich.</strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Es erfasst Kundendaten, Geb&auml;udedaten wie Typ, Lage, W&auml;rmeschutz, Luftdichtigkeit, Anlagendaten wie den Standort,
                        Art der Luft, Luftdurchl&auml;sse, Energie- und Hygienekennzeichen, Raumdaten wie Vorgaben, Geometrie, Art der Zu/Abluft oder den Zuluftfaktor.
                        Ventplan berechnet Au&szlig;enluftvolumenstr&ouml;me, Raumvolumenstr&ouml;me, Druckverlust und Akustik.
                        Ventplan speichert diese Projekte und generiert auf Basis von Odisee Auslegungen, St&uuml;cklisten und Angebote f&uuml;r Ihre Kunden.
                    </p>
                    <p class="white text-r">&lt;/WAS VENTPLAN LEISTET&gt;</p>
                </div>
                <div class="werke_content">
                    <p class="white">&lt;WAS F&Uuml;R VENTPLAN SPRICHT&gt;</p>
                    <p>
                        <strong>Mit Ventplan verringern Sie den &uuml;blichen Aufwand f&uuml;r die Erstellung von Auslegungen und Angeboten um 80%* und sparen enorm viel Zeit!</strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Steigern Sie Ihre Produktivit&auml;t bei der Planung und Berechnung von L&uuml;ftungsanlagen sp&uuml;rbar.
                        Über hinterlegte Artikelst&auml;mme erhalten Sie zu Ihren Berechnungen nicht nur detaillierte St&uuml;cklisten, sondern ebenfalls aussagekr&auml;ftige Angebote f&uuml;r Ihre Kunden.
                        Einmal erstellte Berechnungen lassen sich jederzeit speichern, erneut wiederverwenden und als Angebot exportieren.
                        <br/>
                        <br/>
                        <span style="font-size: small;">* Verringerung des Aufwandes von einer durchschnittlichen Erstellzeit von 90 Minuten pro Berechnung inkl. Erstellung eines Angebotes auf lediglich ca. 15 Minuten.</span>
                    </p>
                    <p class="white text-r">&lt;/WAS F&Uuml;R VENTPLAN SPRICHT&gt;</p>
                    <p>
                        <br/>
                    </p>
                    <p class="white">Ventplan by Art of Coding</p>
                    <ul>
                        <li>Kontinuierliche technische Weiterentwicklung</li>
                        <li>Extreme Zeitersparnis</li>
                        <li>Ventplan Cloud verf&uuml;gbar</li>
                        <li>H&ouml;chste Mobilit&auml;t durch Einsatzf&auml;higkeit auf Notebooks</li>
                        <li>Interation eigener Logos und Gesch&auml;ftsangaben (oder auch von Werbepartnern)</li>
                        <li>Hinterlegung jeglicher Artikelst&auml;mme von Herstellern m&ouml;glich</li>
                        <li>Auslegungen, St&uuml;cklisten, Angebote im PDF und ODF Format verf&uuml;gbar</li>
                    </ul>
                    <p>
                        <strong>Erfahren Sie mehr &uuml;ber Ventplan unter
                            <h:outputLink value="http://www.ventplan.com" target="_blank">www.ventplan.com</h:outputLink></strong>
                    </p>
                </div>
            </div>
        </div>
        <div id="werke_right">
            <div class="werke_title">
                Odisee&reg;
            </div>
            <div class="werke_content_wrapper_right">
                <div class="werke_content">
                    <p class="white">&lt;ODISEE&reg;&gt;</p>
                    <p>
                        <strong>
                            Odisee ist eine Software f&uuml;r das &lt;Output Management/&gt; von digitalen Dokumenten.
                            Mit Odisee k&ouml;nnen akkurate Gesch&auml;ftsdokumente wie Rechnungen, Angebote, Serienbriefe, Reisekostenabrechnungen einfach erstellt werden.
                            Odisee bietet eine automatisierte Bef&uuml;llung mit individuellen Gestaltungs-, Berechnungs- und Textelementen und vereinfacht die Dokumenterstellung damit extrem.
                        </strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Odisee versetzt kleine wie gro&szlig;e Unternehmen in die Lage, mit einem geringen Aufwand ein einheitliches Erscheinungsbild f&uuml;r alle Firmenunterlagen zu erreichen.
                        Dabei k&ouml;nnen verschiedene Benutzer und Applikationen im und au&szlig;erhalb des Unternehmens gleichzeitig mit Odisee arbeiten.
                    </p>
                    <p class="white text-r">
                        &lt;/ODISEE&gt;
                    </p>
                    <p class="white">&lt;WAS ODISEE&reg; LEISTET&gt;</p>
                    <p>
                        <strong>
                            Odisee ist eine intelligente L&ouml;sung f&uuml;r alle Unternehmen, die akkurate Dokumente ausliefern, automatisch mit Logik erzeugen und in den Unternehmensprozess integrieren wollen.
                        </strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Odisee erzeugt Vorlagen f&uuml;r die Korrespondenz (wie z. B. wie Briefe, Mitteilungen oder Protokolle) sowie f&uuml;r den Gesch&auml;ftsverkehr und die Buchhaltung (wie z. B. Rechnungen, Angebote oder Lieferscheine).
                        Odisee versieht Dokumente mit einem einheitlichen Layout nach Ma&szlig;gabe des Corporate Designs.
                        Es unterst&uuml;tzt verschiedenste Bausteine wie Benutzerfelder, Tabellen, Autotexte oder Macros und stellt so korrekte Gesch&auml;ftsangaben und Aussagen sicher.
                        Dabei ist der Output nahezu beliebig: Odisee erzeugt Dokumente z. B. im ODT (OpenDocument)-Format oder als PDF f&uuml;r E-Mail, Fax und Download.
                    </p>
                    <p class="white text-r">
                        &lt;/WAS ODISEE&reg; LEISTET&gt;
                    </p>
                </div>
                <div class="werke_content">
                    <p class="white">&lt;WAS F&Uuml;R ODISEE&reg; SPRICHT&gt;</p>
                    <p>
                        <strong>
                            Mit Odisee werden alle Vorlagen einheitlich mit einer einzigen Technologie, dem OpenDocument-Format, erstellt.
                        </strong>
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Damit k&ouml;nnen alle &uuml;ber Odisee erzeugten Dokumente mit ODT-kompatiblen Programmen wie Apache OpenOffice&reg; und LibreOffice&reg; genutzt werden;
                        auch die aktuellen Versionen von Apple OS X TextEdit und Microsoft WordPad verarbeiten dieses offene Dokumentformat.
                        Benutzern werden die Odisee-Vorlagen &uuml;ber einen HTTP-Server durch eine OpenOffice-oder durch eine LibreOffice-Extension zug&auml;nglich gemacht.
                        Gleichzeitig nutzen auch Applikationen wie ERP, CRM oder ein Online Shop die in OpenOffice, bzw. LibreOffice erstellten Vorlagen &uuml;ber einen Web Service.
                        Dadurch sind die erzeugten Dokumente – unabh&auml;ngig von den Benutzern und/oder den Applikationen – alle gleich und alle akkurat.
                        Weil es sich bei OpenOffice und LibreOffice um freie Software handelt, entstehen durch das jeweilige Textverarbeitungssystem zudem keine zus&auml;tzlichen Lizenzkosten.
                    </p>
                    <p>
                        <br/>
                        <br/>
                        Odisee bringt die IT, die Nutzer und die Applikationenen eines Unternehmens mit dem Ziel zusammen, eine einfache Pflege von Vorlagen zu erm&ouml;glichen, die von allen genutzt werden kann.
                        Odisee makes your documents smile!
                    </p>
                    <p class="white text-r">
                        &lt;/WAS F&Uuml;R ODISEE SPRICHT&gt;
                    </p>
                    <p>Odisee by Art of Coding</p>
                    <ul>
                        <li>Kontinuierliche Weiterentwicklung</li>
                        <li>XML, Web Services (REST und SOAP)</li>
                        <li>{Open|Libre}Office Extensions</li>
                        <li>Template-Archivierung</li>
                        <li>Client verf&uuml;gbar f&uuml;r Java, PHP und Microsoft .NET</li>
                    </ul>
                    <p class="white">
                        <br/>
                        <strong>
                            Erfahren Sie mehr &uuml;ber Odisee unter
                            <h:outputLink value="http://www.odisee.de">www.odisee.de</h:outputLink>
                        </strong>
                    </p>
                </div>
                <div class="werke_content">
                </div>
                <div class="werke_content">
                </div>

            </div>
        </div>
    </ui:define>
    <ui:define name="teaser">
        <div class="">
            <h2>Werke</h2>
            <p>
                Erfahren Sie alles &uuml;ber unsere Produkte.<br/>
                <a href="#" target="_blank" onclick="showWerke(); return false;">&lt; WEITER IM TEXT &gt;</a>
            </p>
        </div>
    </ui:define>
    <ui:define name="javascript">
        <script type="text/javascript" language="JavaScript">
            //<![CDATA[
            $(document).ready(function() {
                var colorFooter = '#ff6700';
                init(colorFooter);
                // Hintergrund einblenden
                $.backstretch("#{resource['images/background/werke.jpg']}");
                changeColors(colorFooter);
            });
            //]]>
        </script>
    </ui:define>
</ui:composition>
</html>
